backend: tensorflow
class_name: Model
config:
  input_layers:
  - [att_nbhd_volume_input_time_1_1, 0, 0]
  - [att_nbhd_volume_input_time_2_1, 0, 0]
  - [att_nbhd_volume_input_time_3_1, 0, 0]
  - [att_nbhd_volume_input_time_1_2, 0, 0]
  - [att_nbhd_volume_input_time_2_2, 0, 0]
  - [att_nbhd_volume_input_time_3_2, 0, 0]
  - [att_nbhd_volume_input_time_1_3, 0, 0]
  - [att_nbhd_volume_input_time_2_3, 0, 0]
  - [att_nbhd_volume_input_time_3_3, 0, 0]
  - [att_flow_volume_input_time_1_1, 0, 0]
  - [att_flow_volume_input_time_2_1, 0, 0]
  - [att_flow_volume_input_time_3_1, 0, 0]
  - [att_flow_volume_input_time_1_2, 0, 0]
  - [att_flow_volume_input_time_2_2, 0, 0]
  - [att_flow_volume_input_time_3_2, 0, 0]
  - [att_flow_volume_input_time_1_3, 0, 0]
  - [att_flow_volume_input_time_2_3, 0, 0]
  - [att_flow_volume_input_time_3_3, 0, 0]
  - [att_lstm_input_1, 0, 0]
  - [att_lstm_input_2, 0, 0]
  - [att_lstm_input_3, 0, 0]
  - [nbhd_volume_input_time_1, 0, 0]
  - [nbhd_volume_input_time_2, 0, 0]
  - [nbhd_volume_input_time_3, 0, 0]
  - [nbhd_volume_input_time_4, 0, 0]
  - [nbhd_volume_input_time_5, 0, 0]
  - [nbhd_volume_input_time_6, 0, 0]
  - [nbhd_volume_input_time_7, 0, 0]
  - [flow_volume_input_time_1, 0, 0]
  - [flow_volume_input_time_2, 0, 0]
  - [flow_volume_input_time_3, 0, 0]
  - [flow_volume_input_time_4, 0, 0]
  - [flow_volume_input_time_5, 0, 0]
  - [flow_volume_input_time_6, 0, 0]
  - [flow_volume_input_time_7, 0, 0]
  - [lstm_input, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: att_flow_volume_input_time_1_1
      sparse: false
    inbound_nodes: []
    name: att_flow_volume_input_time_1_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: att_flow_volume_input_time_2_1
      sparse: false
    inbound_nodes: []
    name: att_flow_volume_input_time_2_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: att_flow_volume_input_time_3_1
      sparse: false
    inbound_nodes: []
    name: att_flow_volume_input_time_3_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: flow_volume_input_time_1
      sparse: false
    inbound_nodes: []
    name: flow_volume_input_time_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: flow_volume_input_time_2
      sparse: false
    inbound_nodes: []
    name: flow_volume_input_time_2
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: flow_volume_input_time_3
      sparse: false
    inbound_nodes: []
    name: flow_volume_input_time_3
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: flow_volume_input_time_4
      sparse: false
    inbound_nodes: []
    name: flow_volume_input_time_4
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: flow_volume_input_time_5
      sparse: false
    inbound_nodes: []
    name: flow_volume_input_time_5
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: flow_volume_input_time_6
      sparse: false
    inbound_nodes: []
    name: flow_volume_input_time_6
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: flow_volume_input_time_7
      sparse: false
    inbound_nodes: []
    name: flow_volume_input_time_7
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: att_flow_volume_input_time_1_2
      sparse: false
    inbound_nodes: []
    name: att_flow_volume_input_time_1_2
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: att_flow_volume_input_time_2_2
      sparse: false
    inbound_nodes: []
    name: att_flow_volume_input_time_2_2
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: att_flow_volume_input_time_3_2
      sparse: false
    inbound_nodes: []
    name: att_flow_volume_input_time_3_2
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: att_flow_volume_input_time_1_3
      sparse: false
    inbound_nodes: []
    name: att_flow_volume_input_time_1_3
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: att_flow_volume_input_time_2_3
      sparse: false
    inbound_nodes: []
    name: att_flow_volume_input_time_2_3
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 4]
      dtype: float32
      name: att_flow_volume_input_time_3_3
      sparse: false
    inbound_nodes: []
    name: att_flow_volume_input_time_3_3
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: att_nbhd_volume_input_time_1_1
      sparse: false
    inbound_nodes: []
    name: att_nbhd_volume_input_time_1_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id002 !!python/tuple [3, 3]
      name: att_flow_convs_time0_1_1
      padding: same
      strides: &id003 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_flow_volume_input_time_1_1
        - 0
        - 0
        - {}
    name: att_flow_convs_time0_1_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: att_nbhd_volume_input_time_2_1
      sparse: false
    inbound_nodes: []
    name: att_nbhd_volume_input_time_2_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id002
      name: att_flow_convs_time0_1_2
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_flow_volume_input_time_2_1
        - 0
        - 0
        - {}
    name: att_flow_convs_time0_1_2
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: att_nbhd_volume_input_time_3_1
      sparse: false
    inbound_nodes: []
    name: att_nbhd_volume_input_time_3_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id002
      name: att_flow_convs_time0_1_3
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_flow_volume_input_time_3_1
        - 0
        - 0
        - {}
    name: att_flow_convs_time0_1_3
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: nbhd_volume_input_time_1
      sparse: false
    inbound_nodes: []
    name: nbhd_volume_input_time_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id004 !!python/tuple [3, 3]
      name: flow_convs_time0_1
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - flow_volume_input_time_1
        - 0
        - 0
        - {}
    name: flow_convs_time0_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: nbhd_volume_input_time_2
      sparse: false
    inbound_nodes: []
    name: nbhd_volume_input_time_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: flow_convs_time0_2
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - flow_volume_input_time_2
        - 0
        - 0
        - {}
    name: flow_convs_time0_2
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: nbhd_volume_input_time_3
      sparse: false
    inbound_nodes: []
    name: nbhd_volume_input_time_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: flow_convs_time0_3
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - flow_volume_input_time_3
        - 0
        - 0
        - {}
    name: flow_convs_time0_3
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: nbhd_volume_input_time_4
      sparse: false
    inbound_nodes: []
    name: nbhd_volume_input_time_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: flow_convs_time0_4
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - flow_volume_input_time_4
        - 0
        - 0
        - {}
    name: flow_convs_time0_4
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: nbhd_volume_input_time_5
      sparse: false
    inbound_nodes: []
    name: nbhd_volume_input_time_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: flow_convs_time0_5
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - flow_volume_input_time_5
        - 0
        - 0
        - {}
    name: flow_convs_time0_5
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: nbhd_volume_input_time_6
      sparse: false
    inbound_nodes: []
    name: nbhd_volume_input_time_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: flow_convs_time0_6
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - flow_volume_input_time_6
        - 0
        - 0
        - {}
    name: flow_convs_time0_6
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: nbhd_volume_input_time_7
      sparse: false
    inbound_nodes: []
    name: nbhd_volume_input_time_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id004
      name: flow_convs_time0_7
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - flow_volume_input_time_7
        - 0
        - 0
        - {}
    name: flow_convs_time0_7
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: att_nbhd_volume_input_time_1_2
      sparse: false
    inbound_nodes: []
    name: att_nbhd_volume_input_time_1_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id002
      name: att_flow_convs_time0_2_1
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_flow_volume_input_time_1_2
        - 0
        - 0
        - {}
    name: att_flow_convs_time0_2_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: att_nbhd_volume_input_time_2_2
      sparse: false
    inbound_nodes: []
    name: att_nbhd_volume_input_time_2_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id002
      name: att_flow_convs_time0_2_2
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_flow_volume_input_time_2_2
        - 0
        - 0
        - {}
    name: att_flow_convs_time0_2_2
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: att_nbhd_volume_input_time_3_2
      sparse: false
    inbound_nodes: []
    name: att_nbhd_volume_input_time_3_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id002
      name: att_flow_convs_time0_2_3
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_flow_volume_input_time_3_2
        - 0
        - 0
        - {}
    name: att_flow_convs_time0_2_3
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: att_nbhd_volume_input_time_1_3
      sparse: false
    inbound_nodes: []
    name: att_nbhd_volume_input_time_1_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id002
      name: att_flow_convs_time0_3_1
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_flow_volume_input_time_1_3
        - 0
        - 0
        - {}
    name: att_flow_convs_time0_3_1
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: att_nbhd_volume_input_time_2_3
      sparse: false
    inbound_nodes: []
    name: att_nbhd_volume_input_time_2_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id002
      name: att_flow_convs_time0_3_2
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_flow_volume_input_time_2_3
        - 0
        - 0
        - {}
    name: att_flow_convs_time0_3_2
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 7, 7, 2]
      dtype: float32
      name: att_nbhd_volume_input_time_3_3
      sparse: false
    inbound_nodes: []
    name: att_nbhd_volume_input_time_3_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id002
      name: att_flow_convs_time0_3_3
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_flow_volume_input_time_3_3
        - 0
        - 0
        - {}
    name: att_flow_convs_time0_3_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id005 !!python/tuple [3, 3]
      name: att_nbhd_convs_time0_1_1
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_nbhd_volume_input_time_1_1
        - 0
        - 0
        - {}
    name: att_nbhd_convs_time0_1_1
  - class_name: Activation
    config: {activation: relu, name: att_flow_convs_activation_time0_1_1, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_time0_1_1
        - 0
        - 0
        - {}
    name: att_flow_convs_activation_time0_1_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: att_nbhd_convs_time0_1_2
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_nbhd_volume_input_time_2_1
        - 0
        - 0
        - {}
    name: att_nbhd_convs_time0_1_2
  - class_name: Activation
    config: {activation: relu, name: att_flow_convs_activation_time0_1_2, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_time0_1_2
        - 0
        - 0
        - {}
    name: att_flow_convs_activation_time0_1_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: att_nbhd_convs_time0_1_3
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_nbhd_volume_input_time_3_1
        - 0
        - 0
        - {}
    name: att_nbhd_convs_time0_1_3
  - class_name: Activation
    config: {activation: relu, name: att_flow_convs_activation_time0_1_3, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_time0_1_3
        - 0
        - 0
        - {}
    name: att_flow_convs_activation_time0_1_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id006 !!python/tuple [3, 3]
      name: nbhd_convs_time0_1
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - nbhd_volume_input_time_1
        - 0
        - 0
        - {}
    name: nbhd_convs_time0_1
  - class_name: Activation
    config: {activation: relu, name: flow_convs_activation_time0_1, trainable: true}
    inbound_nodes:
    - - - flow_convs_time0_1
        - 0
        - 0
        - {}
    name: flow_convs_activation_time0_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: nbhd_convs_time0_2
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - nbhd_volume_input_time_2
        - 0
        - 0
        - {}
    name: nbhd_convs_time0_2
  - class_name: Activation
    config: {activation: relu, name: flow_convs_activation_time0_2, trainable: true}
    inbound_nodes:
    - - - flow_convs_time0_2
        - 0
        - 0
        - {}
    name: flow_convs_activation_time0_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: nbhd_convs_time0_3
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - nbhd_volume_input_time_3
        - 0
        - 0
        - {}
    name: nbhd_convs_time0_3
  - class_name: Activation
    config: {activation: relu, name: flow_convs_activation_time0_3, trainable: true}
    inbound_nodes:
    - - - flow_convs_time0_3
        - 0
        - 0
        - {}
    name: flow_convs_activation_time0_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: nbhd_convs_time0_4
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - nbhd_volume_input_time_4
        - 0
        - 0
        - {}
    name: nbhd_convs_time0_4
  - class_name: Activation
    config: {activation: relu, name: flow_convs_activation_time0_4, trainable: true}
    inbound_nodes:
    - - - flow_convs_time0_4
        - 0
        - 0
        - {}
    name: flow_convs_activation_time0_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: nbhd_convs_time0_5
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - nbhd_volume_input_time_5
        - 0
        - 0
        - {}
    name: nbhd_convs_time0_5
  - class_name: Activation
    config: {activation: relu, name: flow_convs_activation_time0_5, trainable: true}
    inbound_nodes:
    - - - flow_convs_time0_5
        - 0
        - 0
        - {}
    name: flow_convs_activation_time0_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: nbhd_convs_time0_6
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - nbhd_volume_input_time_6
        - 0
        - 0
        - {}
    name: nbhd_convs_time0_6
  - class_name: Activation
    config: {activation: relu, name: flow_convs_activation_time0_6, trainable: true}
    inbound_nodes:
    - - - flow_convs_time0_6
        - 0
        - 0
        - {}
    name: flow_convs_activation_time0_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: nbhd_convs_time0_7
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - nbhd_volume_input_time_7
        - 0
        - 0
        - {}
    name: nbhd_convs_time0_7
  - class_name: Activation
    config: {activation: relu, name: flow_convs_activation_time0_7, trainable: true}
    inbound_nodes:
    - - - flow_convs_time0_7
        - 0
        - 0
        - {}
    name: flow_convs_activation_time0_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: att_nbhd_convs_time0_2_1
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_nbhd_volume_input_time_1_2
        - 0
        - 0
        - {}
    name: att_nbhd_convs_time0_2_1
  - class_name: Activation
    config: {activation: relu, name: att_flow_convs_activation_time0_2_1, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_time0_2_1
        - 0
        - 0
        - {}
    name: att_flow_convs_activation_time0_2_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: att_nbhd_convs_time0_2_2
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_nbhd_volume_input_time_2_2
        - 0
        - 0
        - {}
    name: att_nbhd_convs_time0_2_2
  - class_name: Activation
    config: {activation: relu, name: att_flow_convs_activation_time0_2_2, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_time0_2_2
        - 0
        - 0
        - {}
    name: att_flow_convs_activation_time0_2_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: att_nbhd_convs_time0_2_3
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_nbhd_volume_input_time_3_2
        - 0
        - 0
        - {}
    name: att_nbhd_convs_time0_2_3
  - class_name: Activation
    config: {activation: relu, name: att_flow_convs_activation_time0_2_3, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_time0_2_3
        - 0
        - 0
        - {}
    name: att_flow_convs_activation_time0_2_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: att_nbhd_convs_time0_3_1
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_nbhd_volume_input_time_1_3
        - 0
        - 0
        - {}
    name: att_nbhd_convs_time0_3_1
  - class_name: Activation
    config: {activation: relu, name: att_flow_convs_activation_time0_3_1, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_time0_3_1
        - 0
        - 0
        - {}
    name: att_flow_convs_activation_time0_3_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: att_nbhd_convs_time0_3_2
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_nbhd_volume_input_time_2_3
        - 0
        - 0
        - {}
    name: att_nbhd_convs_time0_3_2
  - class_name: Activation
    config: {activation: relu, name: att_flow_convs_activation_time0_3_2, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_time0_3_2
        - 0
        - 0
        - {}
    name: att_flow_convs_activation_time0_3_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id005
      name: att_nbhd_convs_time0_3_3
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_nbhd_volume_input_time_3_3
        - 0
        - 0
        - {}
    name: att_nbhd_convs_time0_3_3
  - class_name: Activation
    config: {activation: relu, name: att_flow_convs_activation_time0_3_3, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_time0_3_3
        - 0
        - 0
        - {}
    name: att_flow_convs_activation_time0_3_3
  - class_name: Activation
    config: {activation: relu, name: att_nbhd_convs_activation_time0_1_1, trainable: true}
    inbound_nodes:
    - - - att_nbhd_convs_time0_1_1
        - 0
        - 0
        - {}
    name: att_nbhd_convs_activation_time0_1_1
  - class_name: Activation
    config: {activation: sigmoid, name: att_flow_gate0_1_1, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_activation_time0_1_1
        - 0
        - 0
        - {}
    name: att_flow_gate0_1_1
  - class_name: Activation
    config: {activation: relu, name: att_nbhd_convs_activation_time0_1_2, trainable: true}
    inbound_nodes:
    - - - att_nbhd_convs_time0_1_2
        - 0
        - 0
        - {}
    name: att_nbhd_convs_activation_time0_1_2
  - class_name: Activation
    config: {activation: sigmoid, name: att_flow_gate0_1_2, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_activation_time0_1_2
        - 0
        - 0
        - {}
    name: att_flow_gate0_1_2
  - class_name: Activation
    config: {activation: relu, name: att_nbhd_convs_activation_time0_1_3, trainable: true}
    inbound_nodes:
    - - - att_nbhd_convs_time0_1_3
        - 0
        - 0
        - {}
    name: att_nbhd_convs_activation_time0_1_3
  - class_name: Activation
    config: {activation: sigmoid, name: att_flow_gate0_1_3, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_activation_time0_1_3
        - 0
        - 0
        - {}
    name: att_flow_gate0_1_3
  - class_name: Activation
    config: {activation: relu, name: nbhd_convs_activation_time0_1, trainable: true}
    inbound_nodes:
    - - - nbhd_convs_time0_1
        - 0
        - 0
        - {}
    name: nbhd_convs_activation_time0_1
  - class_name: Activation
    config: {activation: sigmoid, name: flow_gate0_1, trainable: true}
    inbound_nodes:
    - - - flow_convs_activation_time0_1
        - 0
        - 0
        - {}
    name: flow_gate0_1
  - class_name: Activation
    config: {activation: relu, name: nbhd_convs_activation_time0_2, trainable: true}
    inbound_nodes:
    - - - nbhd_convs_time0_2
        - 0
        - 0
        - {}
    name: nbhd_convs_activation_time0_2
  - class_name: Activation
    config: {activation: sigmoid, name: flow_gate0_2, trainable: true}
    inbound_nodes:
    - - - flow_convs_activation_time0_2
        - 0
        - 0
        - {}
    name: flow_gate0_2
  - class_name: Activation
    config: {activation: relu, name: nbhd_convs_activation_time0_3, trainable: true}
    inbound_nodes:
    - - - nbhd_convs_time0_3
        - 0
        - 0
        - {}
    name: nbhd_convs_activation_time0_3
  - class_name: Activation
    config: {activation: sigmoid, name: flow_gate0_3, trainable: true}
    inbound_nodes:
    - - - flow_convs_activation_time0_3
        - 0
        - 0
        - {}
    name: flow_gate0_3
  - class_name: Activation
    config: {activation: relu, name: nbhd_convs_activation_time0_4, trainable: true}
    inbound_nodes:
    - - - nbhd_convs_time0_4
        - 0
        - 0
        - {}
    name: nbhd_convs_activation_time0_4
  - class_name: Activation
    config: {activation: sigmoid, name: flow_gate0_4, trainable: true}
    inbound_nodes:
    - - - flow_convs_activation_time0_4
        - 0
        - 0
        - {}
    name: flow_gate0_4
  - class_name: Activation
    config: {activation: relu, name: nbhd_convs_activation_time0_5, trainable: true}
    inbound_nodes:
    - - - nbhd_convs_time0_5
        - 0
        - 0
        - {}
    name: nbhd_convs_activation_time0_5
  - class_name: Activation
    config: {activation: sigmoid, name: flow_gate0_5, trainable: true}
    inbound_nodes:
    - - - flow_convs_activation_time0_5
        - 0
        - 0
        - {}
    name: flow_gate0_5
  - class_name: Activation
    config: {activation: relu, name: nbhd_convs_activation_time0_6, trainable: true}
    inbound_nodes:
    - - - nbhd_convs_time0_6
        - 0
        - 0
        - {}
    name: nbhd_convs_activation_time0_6
  - class_name: Activation
    config: {activation: sigmoid, name: flow_gate0_6, trainable: true}
    inbound_nodes:
    - - - flow_convs_activation_time0_6
        - 0
        - 0
        - {}
    name: flow_gate0_6
  - class_name: Activation
    config: {activation: relu, name: nbhd_convs_activation_time0_7, trainable: true}
    inbound_nodes:
    - - - nbhd_convs_time0_7
        - 0
        - 0
        - {}
    name: nbhd_convs_activation_time0_7
  - class_name: Activation
    config: {activation: sigmoid, name: flow_gate0_7, trainable: true}
    inbound_nodes:
    - - - flow_convs_activation_time0_7
        - 0
        - 0
        - {}
    name: flow_gate0_7
  - class_name: Activation
    config: {activation: relu, name: att_nbhd_convs_activation_time0_2_1, trainable: true}
    inbound_nodes:
    - - - att_nbhd_convs_time0_2_1
        - 0
        - 0
        - {}
    name: att_nbhd_convs_activation_time0_2_1
  - class_name: Activation
    config: {activation: sigmoid, name: att_flow_gate0_2_1, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_activation_time0_2_1
        - 0
        - 0
        - {}
    name: att_flow_gate0_2_1
  - class_name: Activation
    config: {activation: relu, name: att_nbhd_convs_activation_time0_2_2, trainable: true}
    inbound_nodes:
    - - - att_nbhd_convs_time0_2_2
        - 0
        - 0
        - {}
    name: att_nbhd_convs_activation_time0_2_2
  - class_name: Activation
    config: {activation: sigmoid, name: att_flow_gate0_2_2, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_activation_time0_2_2
        - 0
        - 0
        - {}
    name: att_flow_gate0_2_2
  - class_name: Activation
    config: {activation: relu, name: att_nbhd_convs_activation_time0_2_3, trainable: true}
    inbound_nodes:
    - - - att_nbhd_convs_time0_2_3
        - 0
        - 0
        - {}
    name: att_nbhd_convs_activation_time0_2_3
  - class_name: Activation
    config: {activation: sigmoid, name: att_flow_gate0_2_3, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_activation_time0_2_3
        - 0
        - 0
        - {}
    name: att_flow_gate0_2_3
  - class_name: Activation
    config: {activation: relu, name: att_nbhd_convs_activation_time0_3_1, trainable: true}
    inbound_nodes:
    - - - att_nbhd_convs_time0_3_1
        - 0
        - 0
        - {}
    name: att_nbhd_convs_activation_time0_3_1
  - class_name: Activation
    config: {activation: sigmoid, name: att_flow_gate0_3_1, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_activation_time0_3_1
        - 0
        - 0
        - {}
    name: att_flow_gate0_3_1
  - class_name: Activation
    config: {activation: relu, name: att_nbhd_convs_activation_time0_3_2, trainable: true}
    inbound_nodes:
    - - - att_nbhd_convs_time0_3_2
        - 0
        - 0
        - {}
    name: att_nbhd_convs_activation_time0_3_2
  - class_name: Activation
    config: {activation: sigmoid, name: att_flow_gate0_3_2, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_activation_time0_3_2
        - 0
        - 0
        - {}
    name: att_flow_gate0_3_2
  - class_name: Activation
    config: {activation: relu, name: att_nbhd_convs_activation_time0_3_3, trainable: true}
    inbound_nodes:
    - - - att_nbhd_convs_time0_3_3
        - 0
        - 0
        - {}
    name: att_nbhd_convs_activation_time0_3_3
  - class_name: Activation
    config: {activation: sigmoid, name: att_flow_gate0_3_3, trainable: true}
    inbound_nodes:
    - - - att_flow_convs_activation_time0_3_3
        - 0
        - 0
        - {}
    name: att_flow_gate0_3_3
  - class_name: Multiply
    config: {name: multiply_22, trainable: true}
    inbound_nodes:
    - - - att_nbhd_convs_activation_time0_1_1
        - 0
        - 0
        - &id007 {}
      - - att_flow_gate0_1_1
        - 0
        - 0
        - *id007
    name: multiply_22
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id009 !!python/tuple [3, 3]
      name: att_flow_convs_time1_1_1
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_flow_convs_activation_time0_1_1
        - 0
        - 0
        - {}
    name: att_flow_convs_time1_1_1
  - class_name: Multiply
    config: {name: multiply_23, trainable: true}
    inbound_nodes:
    - - - att_nbhd_convs_activation_time0_1_2
        - 0
        - 0
        - &id008 {}
      - - att_flow_gate0_1_2
        - 0
        - 0
        - *id008
    name: multiply_23
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id009
      name: att_flow_convs_time1_1_2
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_flow_convs_activation_time0_1_2
        - 0
        - 0
        - {}
    name: att_flow_convs_time1_1_2
  - class_name: Multiply
    config: {name: multiply_24, trainable: true}
    inbound_nodes:
    - - - att_nbhd_convs_activation_time0_1_3
        - 0
        - 0
        - &id010 {}
      - - att_flow_gate0_1_3
        - 0
        - 0
        - *id010
    name: multiply_24
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id009
      name: att_flow_convs_time1_1_3
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - att_flow_convs_activation_time0_1_3
        - 0
        - 0
        - {}
    name: att_flow_convs_time1_1_3
  - class_name: Multiply
    config: {name: multiply_1, trainable: true}
    inbound_nodes:
    - - - nbhd_convs_activation_time0_1
        - 0
        - 0
        - &id011 {}
      - - flow_gate0_1
        - 0
        - 0
        - *id011
    name: multiply_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id013 !!python/tuple [3, 3]
      name: flow_convs_time1_1
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - flow_volume_input_time_1
        - 0
        - 0
        - {}
    name: flow_convs_time1_1
  - class_name: Multiply
    config: {name: multiply_2, trainable: true}
    inbound_nodes:
    - - - nbhd_convs_activation_time0_2
        - 0
        - 0
        - &id012 {}
      - - flow_gate0_2
        - 0
        - 0
        - *id012
    name: multiply_2
  - class_name: Conv2D
    config:
      activation: linear
