{"class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["activation_1", 0, 0]], "input_layers": [["att_nbhd_volume_input_time_1_1", 0, 0], ["att_nbhd_volume_input_time_2_1", 0, 0], ["att_nbhd_volume_input_time_3_1", 0, 0], ["att_nbhd_volume_input_time_1_2", 0, 0], ["att_nbhd_volume_input_time_2_2", 0, 0], ["att_nbhd_volume_input_time_3_2", 0, 0], ["att_nbhd_volume_input_time_1_3", 0, 0], ["att_nbhd_volume_input_time_2_3", 0, 0], ["att_nbhd_volume_input_time_3_3", 0, 0], ["att_flow_volume_input_time_1_1", 0, 0], ["att_flow_volume_input_time_2_1", 0, 0], ["att_flow_volume_input_time_3_1", 0, 0], ["att_flow_volume_input_time_1_2", 0, 0], ["att_flow_volume_input_time_2_2", 0, 0], ["att_flow_volume_input_time_3_2", 0, 0], ["att_flow_volume_input_time_1_3", 0, 0], ["att_flow_volume_input_time_2_3", 0, 0], ["att_flow_volume_input_time_3_3", 0, 0], ["att_lstm_input_1", 0, 0], ["att_lstm_input_2", 0, 0], ["att_lstm_input_3", 0, 0], ["nbhd_volume_input_time_1", 0, 0], ["nbhd_volume_input_time_2", 0, 0], ["nbhd_volume_input_time_3", 0, 0], ["nbhd_volume_input_time_4", 0, 0], ["nbhd_volume_input_time_5", 0, 0], ["nbhd_volume_input_time_6", 0, 0], ["nbhd_volume_input_time_7", 0, 0], ["flow_volume_input_time_1", 0, 0], ["flow_volume_input_time_2", 0, 0], ["flow_volume_input_time_3", 0, 0], ["flow_volume_input_time_4", 0, 0], ["flow_volume_input_time_5", 0, 0], ["flow_volume_input_time_6", 0, 0], ["flow_volume_input_time_7", 0, 0], ["lstm_input", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "att_flow_volume_input_time_1_1", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "att_flow_volume_input_time_1_1", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_flow_volume_input_time_2_1", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "att_flow_volume_input_time_2_1", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_flow_volume_input_time_3_1", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "att_flow_volume_input_time_3_1", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "flow_volume_input_time_1", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "flow_volume_input_time_1", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "flow_volume_input_time_2", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "flow_volume_input_time_2", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "flow_volume_input_time_3", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "flow_volume_input_time_3", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "flow_volume_input_time_4", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "flow_volume_input_time_4", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "flow_volume_input_time_5", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "flow_volume_input_time_5", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "flow_volume_input_time_6", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "flow_volume_input_time_6", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "flow_volume_input_time_7", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "flow_volume_input_time_7", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_flow_volume_input_time_1_2", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "att_flow_volume_input_time_1_2", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_flow_volume_input_time_2_2", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "att_flow_volume_input_time_2_2", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_flow_volume_input_time_3_2", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "att_flow_volume_input_time_3_2", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_flow_volume_input_time_1_3", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "att_flow_volume_input_time_1_3", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_flow_volume_input_time_2_3", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "att_flow_volume_input_time_2_3", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_flow_volume_input_time_3_3", "config": {"batch_input_shape": [null, 7, 7, 4], "name": "att_flow_volume_input_time_3_3", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_nbhd_volume_input_time_1_1", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "att_nbhd_volume_input_time_1_1", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["att_flow_volume_input_time_1_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_flow_convs_time0_1_1", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_flow_convs_time0_1_1", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_nbhd_volume_input_time_2_1", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "att_nbhd_volume_input_time_2_1", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["att_flow_volume_input_time_2_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_flow_convs_time0_1_2", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_flow_convs_time0_1_2", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_nbhd_volume_input_time_3_1", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "att_nbhd_volume_input_time_3_1", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["att_flow_volume_input_time_3_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_flow_convs_time0_1_3", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_flow_convs_time0_1_3", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "nbhd_volume_input_time_1", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "nbhd_volume_input_time_1", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["flow_volume_input_time_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "flow_convs_time0_1", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "flow_convs_time0_1", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "nbhd_volume_input_time_2", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "nbhd_volume_input_time_2", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["flow_volume_input_time_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "flow_convs_time0_2", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "flow_convs_time0_2", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "nbhd_volume_input_time_3", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "nbhd_volume_input_time_3", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["flow_volume_input_time_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "flow_convs_time0_3", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "flow_convs_time0_3", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "nbhd_volume_input_time_4", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "nbhd_volume_input_time_4", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["flow_volume_input_time_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "flow_convs_time0_4", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "flow_convs_time0_4", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "nbhd_volume_input_time_5", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "nbhd_volume_input_time_5", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["flow_volume_input_time_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "flow_convs_time0_5", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "flow_convs_time0_5", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "nbhd_volume_input_time_6", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "nbhd_volume_input_time_6", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["flow_volume_input_time_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "flow_convs_time0_6", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "flow_convs_time0_6", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "nbhd_volume_input_time_7", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "nbhd_volume_input_time_7", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["flow_volume_input_time_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "flow_convs_time0_7", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "flow_convs_time0_7", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_nbhd_volume_input_time_1_2", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "att_nbhd_volume_input_time_1_2", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["att_flow_volume_input_time_1_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_flow_convs_time0_2_1", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_flow_convs_time0_2_1", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_nbhd_volume_input_time_2_2", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "att_nbhd_volume_input_time_2_2", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["att_flow_volume_input_time_2_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_flow_convs_time0_2_2", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_flow_convs_time0_2_2", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_nbhd_volume_input_time_3_2", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "att_nbhd_volume_input_time_3_2", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["att_flow_volume_input_time_3_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_flow_convs_time0_2_3", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_flow_convs_time0_2_3", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_nbhd_volume_input_time_1_3", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "att_nbhd_volume_input_time_1_3", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["att_flow_volume_input_time_1_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_flow_convs_time0_3_1", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_flow_convs_time0_3_1", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_nbhd_volume_input_time_2_3", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "att_nbhd_volume_input_time_2_3", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["att_flow_volume_input_time_2_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_flow_convs_time0_3_2", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_flow_convs_time0_3_2", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "att_nbhd_volume_input_time_3_3", "config": {"batch_input_shape": [null, 7, 7, 2], "name": "att_nbhd_volume_input_time_3_3", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["att_flow_volume_input_time_3_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_flow_convs_time0_3_3", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_flow_convs_time0_3_3", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["att_nbhd_volume_input_time_1_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_nbhd_convs_time0_1_1", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_nbhd_convs_time0_1_1", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["att_flow_convs_time0_1_1", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_convs_activation_time0_1_1", "config": {"trainable": true, "name": "att_flow_convs_activation_time0_1_1", "activation": "relu"}}, {"inbound_nodes": [[["att_nbhd_volume_input_time_2_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_nbhd_convs_time0_1_2", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_nbhd_convs_time0_1_2", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["att_flow_convs_time0_1_2", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_convs_activation_time0_1_2", "config": {"trainable": true, "name": "att_flow_convs_activation_time0_1_2", "activation": "relu"}}, {"inbound_nodes": [[["att_nbhd_volume_input_time_3_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_nbhd_convs_time0_1_3", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_nbhd_convs_time0_1_3", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["att_flow_convs_time0_1_3", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_convs_activation_time0_1_3", "config": {"trainable": true, "name": "att_flow_convs_activation_time0_1_3", "activation": "relu"}}, {"inbound_nodes": [[["nbhd_volume_input_time_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "nbhd_convs_time0_1", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "nbhd_convs_time0_1", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["flow_convs_time0_1", 0, 0, {}]]], "class_name": "Activation", "name": "flow_convs_activation_time0_1", "config": {"trainable": true, "name": "flow_convs_activation_time0_1", "activation": "relu"}}, {"inbound_nodes": [[["nbhd_volume_input_time_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "nbhd_convs_time0_2", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "nbhd_convs_time0_2", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["flow_convs_time0_2", 0, 0, {}]]], "class_name": "Activation", "name": "flow_convs_activation_time0_2", "config": {"trainable": true, "name": "flow_convs_activation_time0_2", "activation": "relu"}}, {"inbound_nodes": [[["nbhd_volume_input_time_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "nbhd_convs_time0_3", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "nbhd_convs_time0_3", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["flow_convs_time0_3", 0, 0, {}]]], "class_name": "Activation", "name": "flow_convs_activation_time0_3", "config": {"trainable": true, "name": "flow_convs_activation_time0_3", "activation": "relu"}}, {"inbound_nodes": [[["nbhd_volume_input_time_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "nbhd_convs_time0_4", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "nbhd_convs_time0_4", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["flow_convs_time0_4", 0, 0, {}]]], "class_name": "Activation", "name": "flow_convs_activation_time0_4", "config": {"trainable": true, "name": "flow_convs_activation_time0_4", "activation": "relu"}}, {"inbound_nodes": [[["nbhd_volume_input_time_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "nbhd_convs_time0_5", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "nbhd_convs_time0_5", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["flow_convs_time0_5", 0, 0, {}]]], "class_name": "Activation", "name": "flow_convs_activation_time0_5", "config": {"trainable": true, "name": "flow_convs_activation_time0_5", "activation": "relu"}}, {"inbound_nodes": [[["nbhd_volume_input_time_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "nbhd_convs_time0_6", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "nbhd_convs_time0_6", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["flow_convs_time0_6", 0, 0, {}]]], "class_name": "Activation", "name": "flow_convs_activation_time0_6", "config": {"trainable": true, "name": "flow_convs_activation_time0_6", "activation": "relu"}}, {"inbound_nodes": [[["nbhd_volume_input_time_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "nbhd_convs_time0_7", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "nbhd_convs_time0_7", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["flow_convs_time0_7", 0, 0, {}]]], "class_name": "Activation", "name": "flow_convs_activation_time0_7", "config": {"trainable": true, "name": "flow_convs_activation_time0_7", "activation": "relu"}}, {"inbound_nodes": [[["att_nbhd_volume_input_time_1_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_nbhd_convs_time0_2_1", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_nbhd_convs_time0_2_1", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["att_flow_convs_time0_2_1", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_convs_activation_time0_2_1", "config": {"trainable": true, "name": "att_flow_convs_activation_time0_2_1", "activation": "relu"}}, {"inbound_nodes": [[["att_nbhd_volume_input_time_2_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_nbhd_convs_time0_2_2", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_nbhd_convs_time0_2_2", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["att_flow_convs_time0_2_2", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_convs_activation_time0_2_2", "config": {"trainable": true, "name": "att_flow_convs_activation_time0_2_2", "activation": "relu"}}, {"inbound_nodes": [[["att_nbhd_volume_input_time_3_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_nbhd_convs_time0_2_3", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_nbhd_convs_time0_2_3", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["att_flow_convs_time0_2_3", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_convs_activation_time0_2_3", "config": {"trainable": true, "name": "att_flow_convs_activation_time0_2_3", "activation": "relu"}}, {"inbound_nodes": [[["att_nbhd_volume_input_time_1_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_nbhd_convs_time0_3_1", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_nbhd_convs_time0_3_1", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["att_flow_convs_time0_3_1", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_convs_activation_time0_3_1", "config": {"trainable": true, "name": "att_flow_convs_activation_time0_3_1", "activation": "relu"}}, {"inbound_nodes": [[["att_nbhd_volume_input_time_2_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_nbhd_convs_time0_3_2", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_nbhd_convs_time0_3_2", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["att_flow_convs_time0_3_2", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_convs_activation_time0_3_2", "config": {"trainable": true, "name": "att_flow_convs_activation_time0_3_2", "activation": "relu"}}, {"inbound_nodes": [[["att_nbhd_volume_input_time_3_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_nbhd_convs_time0_3_3", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_nbhd_convs_time0_3_3", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["att_flow_convs_time0_3_3", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_convs_activation_time0_3_3", "config": {"trainable": true, "name": "att_flow_convs_activation_time0_3_3", "activation": "relu"}}, {"inbound_nodes": [[["att_nbhd_convs_time0_1_1", 0, 0, {}]]], "class_name": "Activation", "name": "att_nbhd_convs_activation_time0_1_1", "config": {"trainable": true, "name": "att_nbhd_convs_activation_time0_1_1", "activation": "relu"}}, {"inbound_nodes": [[["att_flow_convs_activation_time0_1_1", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_gate0_1_1", "config": {"trainable": true, "name": "att_flow_gate0_1_1", "activation": "sigmoid"}}, {"inbound_nodes": [[["att_nbhd_convs_time0_1_2", 0, 0, {}]]], "class_name": "Activation", "name": "att_nbhd_convs_activation_time0_1_2", "config": {"trainable": true, "name": "att_nbhd_convs_activation_time0_1_2", "activation": "relu"}}, {"inbound_nodes": [[["att_flow_convs_activation_time0_1_2", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_gate0_1_2", "config": {"trainable": true, "name": "att_flow_gate0_1_2", "activation": "sigmoid"}}, {"inbound_nodes": [[["att_nbhd_convs_time0_1_3", 0, 0, {}]]], "class_name": "Activation", "name": "att_nbhd_convs_activation_time0_1_3", "config": {"trainable": true, "name": "att_nbhd_convs_activation_time0_1_3", "activation": "relu"}}, {"inbound_nodes": [[["att_flow_convs_activation_time0_1_3", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_gate0_1_3", "config": {"trainable": true, "name": "att_flow_gate0_1_3", "activation": "sigmoid"}}, {"inbound_nodes": [[["nbhd_convs_time0_1", 0, 0, {}]]], "class_name": "Activation", "name": "nbhd_convs_activation_time0_1", "config": {"trainable": true, "name": "nbhd_convs_activation_time0_1", "activation": "relu"}}, {"inbound_nodes": [[["flow_convs_activation_time0_1", 0, 0, {}]]], "class_name": "Activation", "name": "flow_gate0_1", "config": {"trainable": true, "name": "flow_gate0_1", "activation": "sigmoid"}}, {"inbound_nodes": [[["nbhd_convs_time0_2", 0, 0, {}]]], "class_name": "Activation", "name": "nbhd_convs_activation_time0_2", "config": {"trainable": true, "name": "nbhd_convs_activation_time0_2", "activation": "relu"}}, {"inbound_nodes": [[["flow_convs_activation_time0_2", 0, 0, {}]]], "class_name": "Activation", "name": "flow_gate0_2", "config": {"trainable": true, "name": "flow_gate0_2", "activation": "sigmoid"}}, {"inbound_nodes": [[["nbhd_convs_time0_3", 0, 0, {}]]], "class_name": "Activation", "name": "nbhd_convs_activation_time0_3", "config": {"trainable": true, "name": "nbhd_convs_activation_time0_3", "activation": "relu"}}, {"inbound_nodes": [[["flow_convs_activation_time0_3", 0, 0, {}]]], "class_name": "Activation", "name": "flow_gate0_3", "config": {"trainable": true, "name": "flow_gate0_3", "activation": "sigmoid"}}, {"inbound_nodes": [[["nbhd_convs_time0_4", 0, 0, {}]]], "class_name": "Activation", "name": "nbhd_convs_activation_time0_4", "config": {"trainable": true, "name": "nbhd_convs_activation_time0_4", "activation": "relu"}}, {"inbound_nodes": [[["flow_convs_activation_time0_4", 0, 0, {}]]], "class_name": "Activation", "name": "flow_gate0_4", "config": {"trainable": true, "name": "flow_gate0_4", "activation": "sigmoid"}}, {"inbound_nodes": [[["nbhd_convs_time0_5", 0, 0, {}]]], "class_name": "Activation", "name": "nbhd_convs_activation_time0_5", "config": {"trainable": true, "name": "nbhd_convs_activation_time0_5", "activation": "relu"}}, {"inbound_nodes": [[["flow_convs_activation_time0_5", 0, 0, {}]]], "class_name": "Activation", "name": "flow_gate0_5", "config": {"trainable": true, "name": "flow_gate0_5", "activation": "sigmoid"}}, {"inbound_nodes": [[["nbhd_convs_time0_6", 0, 0, {}]]], "class_name": "Activation", "name": "nbhd_convs_activation_time0_6", "config": {"trainable": true, "name": "nbhd_convs_activation_time0_6", "activation": "relu"}}, {"inbound_nodes": [[["flow_convs_activation_time0_6", 0, 0, {}]]], "class_name": "Activation", "name": "flow_gate0_6", "config": {"trainable": true, "name": "flow_gate0_6", "activation": "sigmoid"}}, {"inbound_nodes": [[["nbhd_convs_time0_7", 0, 0, {}]]], "class_name": "Activation", "name": "nbhd_convs_activation_time0_7", "config": {"trainable": true, "name": "nbhd_convs_activation_time0_7", "activation": "relu"}}, {"inbound_nodes": [[["flow_convs_activation_time0_7", 0, 0, {}]]], "class_name": "Activation", "name": "flow_gate0_7", "config": {"trainable": true, "name": "flow_gate0_7", "activation": "sigmoid"}}, {"inbound_nodes": [[["att_nbhd_convs_time0_2_1", 0, 0, {}]]], "class_name": "Activation", "name": "att_nbhd_convs_activation_time0_2_1", "config": {"trainable": true, "name": "att_nbhd_convs_activation_time0_2_1", "activation": "relu"}}, {"inbound_nodes": [[["att_flow_convs_activation_time0_2_1", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_gate0_2_1", "config": {"trainable": true, "name": "att_flow_gate0_2_1", "activation": "sigmoid"}}, {"inbound_nodes": [[["att_nbhd_convs_time0_2_2", 0, 0, {}]]], "class_name": "Activation", "name": "att_nbhd_convs_activation_time0_2_2", "config": {"trainable": true, "name": "att_nbhd_convs_activation_time0_2_2", "activation": "relu"}}, {"inbound_nodes": [[["att_flow_convs_activation_time0_2_2", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_gate0_2_2", "config": {"trainable": true, "name": "att_flow_gate0_2_2", "activation": "sigmoid"}}, {"inbound_nodes": [[["att_nbhd_convs_time0_2_3", 0, 0, {}]]], "class_name": "Activation", "name": "att_nbhd_convs_activation_time0_2_3", "config": {"trainable": true, "name": "att_nbhd_convs_activation_time0_2_3", "activation": "relu"}}, {"inbound_nodes": [[["att_flow_convs_activation_time0_2_3", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_gate0_2_3", "config": {"trainable": true, "name": "att_flow_gate0_2_3", "activation": "sigmoid"}}, {"inbound_nodes": [[["att_nbhd_convs_time0_3_1", 0, 0, {}]]], "class_name": "Activation", "name": "att_nbhd_convs_activation_time0_3_1", "config": {"trainable": true, "name": "att_nbhd_convs_activation_time0_3_1", "activation": "relu"}}, {"inbound_nodes": [[["att_flow_convs_activation_time0_3_1", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_gate0_3_1", "config": {"trainable": true, "name": "att_flow_gate0_3_1", "activation": "sigmoid"}}, {"inbound_nodes": [[["att_nbhd_convs_time0_3_2", 0, 0, {}]]], "class_name": "Activation", "name": "att_nbhd_convs_activation_time0_3_2", "config": {"trainable": true, "name": "att_nbhd_convs_activation_time0_3_2", "activation": "relu"}}, {"inbound_nodes": [[["att_flow_convs_activation_time0_3_2", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_gate0_3_2", "config": {"trainable": true, "name": "att_flow_gate0_3_2", "activation": "sigmoid"}}, {"inbound_nodes": [[["att_nbhd_convs_time0_3_3", 0, 0, {}]]], "class_name": "Activation", "name": "att_nbhd_convs_activation_time0_3_3", "config": {"trainable": true, "name": "att_nbhd_convs_activation_time0_3_3", "activation": "relu"}}, {"inbound_nodes": [[["att_flow_convs_activation_time0_3_3", 0, 0, {}]]], "class_name": "Activation", "name": "att_flow_gate0_3_3", "config": {"trainable": true, "name": "att_flow_gate0_3_3", "activation": "sigmoid"}}, {"inbound_nodes": [[["att_nbhd_convs_activation_time0_1_1", 0, 0, {}], ["att_flow_gate0_1_1", 0, 0, {}]]], "class_name": "Multiply", "name": "multiply_22", "config": {"trainable": true, "name": "multiply_22"}}, {"inbound_nodes": [[["att_flow_convs_activation_time0_1_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_flow_convs_time1_1_1", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_flow_convs_time1_1_1", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["att_nbhd_convs_activation_time0_1_2", 0, 0, {}], ["att_flow_gate0_1_2", 0, 0, {}]]], "class_name": "Multiply", "name": "multiply_23", "config": {"trainable": true, "name": "multiply_23"}}, {"inbound_nodes": [[["att_flow_convs_activation_time0_1_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_flow_convs_time1_1_2", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_flow_convs_time1_1_2", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["att_nbhd_convs_activation_time0_1_3", 0, 0, {}], ["att_flow_gate0_1_3", 0, 0, {}]]], "class_name": "Multiply", "name": "multiply_24", "config": {"trainable": true, "name": "multiply_24"}}, {"inbound_nodes": [[["att_flow_convs_activation_time0_1_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "att_flow_convs_time1_1_3", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "att_flow_convs_time1_1_3", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["nbhd_convs_activation_time0_1", 0, 0, {}], ["flow_gate0_1", 0, 0, {}]]], "class_name": "Multiply", "name": "multiply_1", "config": {"trainable": true, "name": "multiply_1"}}, {"inbound_nodes": [[["flow_volume_input_time_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "flow_convs_time1_1", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "flow_convs_time1_1", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["nbhd_convs_activation_time0_2", 0, 0, {}], ["flow_gate0_2", 0, 0, {}]]], "class_name": "Multiply", "name": "multiply_2", "config": {"trainable": true, "name": "multiply_2"}}, {"inbound_nodes": [[["flow_volume_input_time_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "flow_convs_time1_2", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "flow_convs_time1_2", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["nbhd_convs_activation_time0_3", 0, 0, {}], ["flow_gate0_3", 0, 0, {}]]], "class_name": "Multiply", "name": "multiply_3", "config": {"trainable": true, "name": "multiply_3"}}, {"inbound_nodes": [[["flow_volume_input_time_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "flow_convs_time1_3", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "flow_convs_time1_3", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["nbhd_convs_activation_time0_4", 0, 0, {}], ["flow_gate0_4", 0, 0, {}]]], "class_name": "Multiply", "name": "multiply_4", "config": {"trainable": true, "name": "multiply_4"}}, {"inbound_nodes": [[["flow_volume_input_time_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "flow_convs_time1_4", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "flow_convs_time1_4", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["nbhd_convs_activation_time0_5", 0, 0, {}], ["flow_gate0_5", 0, 0, {}]]], "class_name": "Multiply", "name": "multiply_5", "config": {"trainable": true, "name": "multiply_5"}}, {"inbound_nodes": [[["flow_volume_input_time_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "flow_convs_time1_5", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "flow_convs_time1_5", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["nbhd_convs_activation_time0_6", 0, 0, {}], ["flow_gate0_6", 0, 0, {}]]], "class_name": "Multiply", "name": "multiply_6", "config": {"trainable": true, "name": "multiply_6"}}, {"inbound_nodes": [[["flow_volume_input_time_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "flow_convs_time1_6", "config": {"trainable": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "flow_convs_time1_6", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "padding": "same"}}, {"inbound_nodes": [[["nbhd_convs_activation_time0_7", 0, 0, {}], ["flow_gate0_7", 0, 0, {}]]], "class_name": "Multiply", "name": "multiply_7", "config": {"trainable": true, "name": "multiply_7"}}, {"inbound_nodes": [[["flow_volume_input_time_7", 0, 0, {}]]], "class_name": "Conv2D", "name": 